// Напишите программу, которая задает массив из 8 элементов,
// заполненный нулями и единицами в произвольном порядке.
// [1,0,1,1,0,1,0,0]
Console.Clear();
Console.Write("Введите размер массива: ");
int arraySize = Convert.ToInt32(Console.ReadLine());
